app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 6]]
---
<ul>
  <% @project.tasks.each do |task| %>