app/controllers/projects_controller.rb

	def create
		@project = Project.new(project_params)
		respond_to do |format|
			if @project.save
---
INSERT INTO "projects" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hoge"], ["content", "hoge"], ["created_at", "2015-05-18 02:37:28.637732"], ["updated_at", "2015-05-18 02:37:28.637732"]]

	def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Juken"], ["content", "narasennan"], ["updated_at", "2015-05-18 04:32:48.915159"], ["id", 6]]