app/controllers/tasks_controller.rb

	def create
		@project = Project.find(params[:project_id])
		@task = @project.tasks.create(task_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "tasks" ("title", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "shoronbun"], ["project_id", 2], ["created_at", "2015-05-18 05:05:21.563171"], ["updated_at", "2015-05-18 05:05:21.563171"]]

	def toggle
		render nothing:true
		@task = Task.find(params[:id])
		@task.done = !@task.done
		@task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", "t"], ["updated_at", "2015-05-18 05:51:26.588819"], ["id", 13]]